rails-devise/app/controllers/moviegoers_controller.rb

SELECT "moviegoers".* FROM "moviegoers"
---
	def index
		@moviegoers = Moviegoer.all