rails-devise/app/controllers/movies_controller.rb

UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "Test"], ["updated_at", "2023-05-01 21:19:37.493736"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)