rails-devise/app/controllers/reviews_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "moviegoers".* FROM "moviegoers"
---
	def new
		id_movie = params[:movie_id]
		@movie = Movie.find(id_movie)
		@moviegoers = Moviegoer.all

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "moviegoers".* FROM "moviegoers"
INSERT INTO "reviews" ("potatoes", "comments", "movie_id", "moviegoer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["potatoes", 4], ["comments", "What a great movie!"], ["movie_id", 1], ["moviegoer_id", 1], ["created_at", "2023-05-01 21:20:24.449352"], ["updated_at", "2023-05-01 21:20:24.449352"]]
---
	def create
		id_movie = params[:movie_id]
		@movie = Movie.find(id_movie)
		id_moviegoer = params[:review][:moviegoer_id]
		@moviegoer = Moviegoer.find(id_moviegoer)
		@moviegoers = Moviegoer.all
		@review = Review.new(review_params)
		@review.movie = @movie
		if @review.save