rails-devise/app/views/movies/show.html.erb

<h2> Reviews: </h2>
  <% if @movie.reviews.empty? %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
SELECT 1 AS one FROM "reviews" WHERE "reviews"."movie_id" = ? LIMIT ?  [["movie_id", 1], ["LIMIT", 1]]

    <ul>
    <% @movie.reviews.each do |r| %>
      <li> <%= r.potatoes %> -  <%= Moviegoer.find(r.moviegoer_id).name %> </li>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]